[
  {
    "title": "1984",
    "author": "George Orwell",
    "price": 250,
    "publishedYear": 1949,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.0,
    "description": "Dystopian classic about totalistic surveillance. The story explores a grim future where individuality is crushed by a totalitarian regime. Orwell portrays Big Brother as the ultimate symbol of authoritarian power. Themes of propaganda, psychological control, and loss of freedom dominate the novel. It remains one of the most influential works warning against unchecked political power.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/0451524934-M.jpg"
  },
  {
    "title": "Murder Most Foul",
    "author": "Ray Bradbury, Jack London, Edgar Allan Poe et al.",
    "price": 350,
    "publishedYear": 1984,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 3.5,
    "description": "Anthology of classic mystery stories. This collection brings together several great writers known for suspense and detective fiction. It includes eerie tales, chilling whodunits, and psychological thrillers. Each story offers a glimpse into different writing styles and narrative twists. Ideal for readers who enjoy vintage and timeless mysteries.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL15365739M-M.jpg"
  },
  {
    "title": "The Body in the Library",
    "author": "Agatha Christie",
    "price": 275,
    "publishedYear": 1942,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.0,
    "description": "Miss Marple investigates a body found in a library. Classic Christie charm blends with clever misdirection and small‑village secrets. The novel showcases her keen observation of human nature. Clues are sprinkled in deceptively simple ways. Suspense builds to a satisfying, unexpected reveal in true Christie fashion.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL9241041M-M.jpg"
  },
  {
    "title": "The Mystery of a Hansom Cab",
    "author": "Fergus Hume",
    "price": 350,
    "publishedYear": 1886,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 3.5,
    "description": "Whodunit classic set in Victorian Melbourne. Considered one of the first true detective novels, it captures 19th‑century society vividly. The plot follows a murder investigation beginning in a hansom cab. Class politics and social intrigue play major roles in the mystery. Its runaway success influenced later detective fiction worldwide.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL8476357M-M.jpg"
  },
  {
    "title": "The Red House Mystery",
    "author": "A. A. Milne",
    "price": 250,
    "publishedYear": 1922,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.5,
    "description": "A.A. Milne’s only mystery novel. Best known as the creator of Winnie‑the‑Pooh, Milne crafts a clever country‑house murder. Amateur sleuths piece together alibis, motives, and hidden truths. The writing blends humor, charm, and puzzle‑like plotting. A treat for fans of Golden Age detective fiction.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL6032228M-M.jpg"
  },
  {
    "title": "Iron Lake",
    "author": "William Kent Krueger",
    "price": 400,
    "publishedYear": 1998,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 3.5,
    "description": "First Cork O’Connor novel set in Minnesota. It introduces readers to the ex‑sheriff navigating crime, politics, and Native American culture. The book blends a murder mystery with emotional family struggles. Small-town atmosphere and wilderness elements create added tension. It laid the foundation for a popular long‑running series.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9780671036904-M.jpg"
  },
  {
    "title": "The Night Circus",
    "author": "Erin Morgenstern",
    "price": 350,
    "publishedYear": 2011,
    "genre": "Fiction",
    "category": "Fantasy",
    "language": "English",
    "rating": 2.5,
    "description": "Phantasmagorical magical competition. A mysterious traveling circus becomes the arena for two rival illusionists. The setting is steeped in vivid imagery and dreamlike enchantment. Romance slowly develops amid the rivalry, adding emotional suspense. Known for its atmospheric tone and lyrical style, it divides readers with its unconventional pacing.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL24983156M-M.jpg"
  },
  {
    "title": "Stardust",
    "author": "Neil Gaiman",
    "price": 200,
    "publishedYear": 1999,
    "genre": "Fiction",
    "category": "Fantasy",
    "language": "English",
    "rating": 4.0,
    "description": "Magical fantasy quest beyond the wall. The novel mixes fairy‑tale whimsy with darker mythic tones. A young man ventures into a magical land to retrieve a fallen star. Along the way, he faces witches, rival seekers, and enchanted worlds. Gaiman’s storytelling blends folklore with modern sensibilities for timeless appeal.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL7288669M-M.jpg"
  },
  {
    "title": "A Court of Silver Flames",
    "author": "Sarah J. Maas",
    "price": 350,
    "publishedYear": 2021,
    "genre": "Fiction",
    "category": "Fantasy",
    "language": "English",
    "rating": 3.5,
    "description": "High fantasy romance with power struggles. This installment focuses on Nesta Archeron’s personal journey of healing. Themes of trauma, resilience, and female empowerment are central. Relationships deepen in both intimate and political ways. Action, romance, and magic intertwine in Maas’s signature style.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL45302483M-M.jpg"
  },
  {
    "title": "The Price of Salt",
    "author": "Patricia Highsmith",
    "price": 350,
    "publishedYear": 1952,
    "genre": "Fiction",
    "category": "Romance & Comedy",
    "language": "English",
    "rating": 3.5,
    "description": "A lesbian romance classic. It tells the story of Therese and Carol’s unexpected romance in 1950s America. Unlike many works at the time, it offered a hopeful ending. Themes of identity, forbidden love, and self‑discovery dominate. The book influenced LGBTQ+ literature for decades.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL6111394M-M.jpg"
  },
  {
    "title": "Romantic Comedy",
    "author": "Curtis Sittenfeld",
    "price": 450,
    "publishedYear": 2023,
    "genre": "Fiction",
    "category": "Romance & Comedy",
    "language": "English",
    "rating": 3.5,
    "description": "Meta-rom-com by the author of The Love Interest. The novel explores romance behind the scenes of a sketch comedy show. It blends humor with a sharp commentary on fame and relationships. The writing highlights gender dynamics in media and love. Sittenfeld creates both humorous and introspective moments that feel fresh in the rom‑com genre.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL40199342M-M.jpg"
  },
  {
    "title": "Funny Story",
    "author": "Emily Henry",
    "price": 350,
    "publishedYear": 2023,
    "genre": "Fiction",
    "category": "Romance & Comedy",
    "language": "English",
    "rating": 3.6,
    "description": "Lighthearted romance with witty dialogue. It centers on unexpected relationships born out of awkward circumstances. Henry blends humor, heart, and genuine emotional growth. The story leans on sharp banter between characters and clever playful setups. A modern romantic comedy with depth beneath its breezy tone.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL52185172M-M.jpg"
  },
  {
    "title": "The Bee Sting",
    "author": "Paul Murray",
    "price": 250,
    "publishedYear": 2023,
    "genre": "Fiction",
    "category": "Romance & Comedy",
    "language": "English",
    "rating": 3.5,
    "description": "Multi‑layered tragicomedy. The novel weaves together the perspectives of a struggling family. It explores themes of ambition, regret, and generational conflict. Written with biting humor and empathy, it captures the absurdity of everyday life. Murray builds a darkly comic yet ultimately haunting portrait of human frailty.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL39700168M-M.jpg"
  },
  {
    "title": "The Atlas Six",
    "author": "Olivie Blake",
    "price": 350,
    "publishedYear": 2021,
    "genre": "Fiction",
    "category": "Fantasy",
    "language": "English",
    "rating": 3.0,
    "description": "Dark academia fantasy. A secretive society offers membership to only six gifted magicians. Rivalry, betrayal, and power struggles dominate their interactions. The book’s morally gray characters heighten the tension. Philosophical undertones and intellectual debates are layered throughout the story.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL35256139M-M.jpg"
  },
  {
    "title": "The Silent Patient",
    "author": "Alex Michaelides",
    "price": 550,
    "publishedYear": 2019,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.5,
    "description": "Psychological thriller about a silent actress. The novel follows the patient Alicia Berenson and the therapist who is determined to unravel her secret. Twists and unreliable narration keep readers questioning the truth. Themes of obsession, trauma, and identity are central. Its shocking climax has made it a bestseller in modern thrillers.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL29804918M-M.jpg"
  },
  {
    "title": "Verity",
    "author": "Colleen Hoover",
    "price": 350,
    "publishedYear": 2018,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 5.0,
    "description": "Twisted thriller with unreliable author narrator. When a struggling writer is hired to complete a famous novelist’s series, she uncovers a chilling unfinished manuscript. The book interweaves romance, thriller, and psychological horror. Hoover crafts shocking reveals that blur truth and fiction. It leaves readers unsettled long after finishing.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9781538724736-M.jpg"
  },
  {
    "title": "Cuckoo’s Calling",
    "author": "Robert Galbraith",
    "price": 300,
    "publishedYear": 2013,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.5,
    "description": "Private detective investigates supermodel’s death. The story introduces Cormoran Strike, an observant and unconventional investigator. Rich character development mixes with a strong London setting. Themes of fame, greed, and hidden truths drive the mystery. Its balance of grit and elegance helped reboot the detective fiction genre.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL25430214M-M.jpg"
  },
  {
    "title": "The Seven Husbands of Evelyn Hugo",
    "author": "Taylor Jenkins Reid",
    "price": 350,
    "publishedYear": 2017,
    "genre": "Fiction",
    "category": "Romance & Comedy",
    "language": "English",
    "rating": 5.0,
    "description": "Old Hollywood romance with twist. It tells the tale of Evelyn Hugo, a glamorous actress revealing her life’s secrets to a young journalist. Themes of identity, ambition, and forbidden love dominate the narrative. Reid delivers emotional depth while critiquing fame and media. The story’s layered revelations make it unforgettable to readers.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL35578972M-M.jpg"
  },
  {
    "title": "Normal People",
    "author": "Sally Rooney",
    "price": 375,
    "publishedYear": 2018,
    "genre": "Fiction",
    "category": "Romance & Comedy",
    "language": "English",
    "rating": 3.0,
    "description": "Contemporary relationship drama. It follows Connell and Marianne across years of complicated intimacy. Themes of love, class, and emotional miscommunication anchor the narrative. Rooney’s sparse prose captures vulnerability and generational anxieties. The novel became a cultural phenomenon and sparked a popular TV adaptation.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9780571334650-M.jpg"
  },
  {
    "title": "Man's Search for Meaning",
    "author": "Viktor E. Frankl",
    "price": 200,
    "publishedYear": 1946,
    "genre": "Non-Fiction",
    "category": "Biography",
    "language": "English",
    "rating": 2.0,
    "description": "Psychiatrist Frankl’s memoir and logotherapy insights born from his Holocaust experience. The first half offers harrowing accounts of life in Nazi concentration camps. The second half explains his psychological theory that meaning sustains human survival. It inspires resilience in suffering and gives practical wisdom. Despite its grim subject, it is hopeful in outlook.",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/8512921-M.jpg"
  },
  {
    "title": "The Story of Philosophy",
    "author": "Will Durant",
    "price": 450,
    "publishedYear": 1926,
    "genre": "Non-Fiction",
    "category": "Philosophy",
    "language": "English",
    "rating": 1.0,
    "description": "Accessible biographies and ideas of key Western philosophers, from Plato to Russell. Durant explains complex ideas in clear and engaging prose. The book introduces readers to major schools of thought and their historical contexts. Its approachable style makes it a good entry point for philosophy beginners. Despite being dated, it remains influential for popularizing philosophy.",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/240726-M.jpg"
  },
  {
    "title": "The 4‑Hour Body",
    "author": "Timothy Ferriss",
    "price": 350,
    "publishedYear": 2010,
    "genre": "Non-Fiction",
    "category": "Health Fitness Diet",
    "language": "English",
    "rating": 2.0,
    "description": "A guide to rapid fat‑loss, performance and body‑hacking based on self‑experimentation. Ferriss explores unconventional strategies for fitness, diet, and sleep. The book blends anecdotal experience with unusual health ‘hacks’. Some advice is controversial, generating both praise and skepticism. It reflects Ferriss’s broader philosophy of lifestyle design and experimentation.",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/10556738-M.jpg"
  },
  {
    "title": "At the Existentialist Café",
    "author": "Sarah Bakewell",
    "price": 550,
    "publishedYear": 2016,
    "genre": "Non-Fiction",
    "category": "Philosophy",
    "language": "English",
    "rating": 5.0,
    "description": "Lives and ideas of Sartre, de Beauvoir and Camus brought together in narrative philosophy. The book blends biography with intellectual history. Bakewell captures the vitality of mid‑20th century existentialism in Europe. The café conversations become a metaphor for philosophy meeting real life. It brings abstract philosophy down to human drama and interpersonal conflict.",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/8231856-M.jpg"
  },
  {
    "title": "Unended Quest: An Intellectual Autobiography",
    "author": "Karl Popper",
    "price": 300,
    "publishedYear": 1976,
    "genre": "Non-Fiction",
    "category": "Biography",
    "language": "English",
    "rating": 4.0,
    "description": "Philosopher Popper's life story and the evolution of his critical rationalist ideas. The book traces his early years in Vienna amid political turmoil. Popper reflects on his contributions to the philosophy of science. He emphasizes falsification as the core of scientific progress. It’s both a personal memoir and an intellectual journey through critical thought.",
    "coverImageUrl": "https://upload.wikimedia.org/wikipedia/en/5/5d/Unended_Quest%2C_Karl_Popper_book.jpg"
  },
  {
    "title": "Atomic Habits",
    "author": "James Clear",
    "price": 350,
    "publishedYear": 2018,
    "genre": "Self-Help",
    "category": "Self-Improvement",
    "language": "English",
    "rating": 5.0,
    "description": "An easy and proven way to build good habits and break bad ones. Clear focuses on small, incremental changes that lead to compounding success. He emphasizes systems over goals for long-term improvement. The book draws on psychology, neuroscience, and real-world case studies. Its practical advice makes it one of the most widely recommended habit guides.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL32336498M-M.jpg"
  },
  {
    "title": "The Power of Now",
    "author": "Eckhart Tolle",
    "price": 450,
    "publishedYear": 1997,
    "genre": "Self-Help",
    "category": "Mindfulness & Spirituality",
    "language": "English",
    "rating": 3.5,
    "description": "A guide to spiritual enlightenment focused on presence and mindfulness. Tolle argues that most mental suffering arises from obsession with past and future. He teaches acceptance of the present moment as transformative. The work blends practical spirituality, meditation, and philosophy. Its clear yet mystical tone has attracted millions of followers worldwide.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9781577311522-M.jpg"
  },
  {
    "title": "Think and Grow Rich",
    "author": "Napoleon Hill",
    "price": 250,
    "publishedYear": 1937,
    "genre": "Self-Help",
    "category": "Self-Improvement",
    "language": "English",
    "rating": 4.5,
    "description": "A classic on developing a wealth mindset and success through thought habits. Hill distills lessons from interviews with wealthy industrialists of his time. The book emphasizes the power of organized thoughts and belief. It combines practical strategies with a quasi-philosophical outlook. Its influence extends into modern self-help and motivational literature.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9781788441025-M.jpg"
  },
  {
    "title": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "price": 350,
    "publishedYear": 2016,
    "genre": "Self-Help",
    "category": "Self-Improvement",
    "language": "English",
    "rating": 3.5,
    "description": "A counterintuitive approach to living a good life by caring less. Manson emphasizes choosing values wisely rather than pursuing constant positivity. His blunt, conversational style criticizes mainstream self-help. The book uses humor and anecdotes to challenge cultural expectations. It encourages authenticity and resilience in dealing with life’s hardships.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9780062457714-M.jpg"
  },
  {
    "title": "The Untethered Soul",
    "author": "Michael A. Singer",
    "price": 450,
    "publishedYear": 2007,
    "genre": "Self-Help",
    "category": "Mindfulness & Spirituality",
    "language": "English",
    "rating": 3.5,
    "description": "Explores the question of who we are and how to live with inner freedom. Singer examines consciousness through meditation and awareness practices. It explains how to quiet the inner voice of constant thought. The book offers tools for transcending fear and cultivating peace. It blends Eastern spirituality with accessible personal development ideas.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9781572245372-M.jpg"
  },
  {
    "title": "Introduction to Financial Technology",
    "author": "Roy S. Freedman",
    "price": 250,
    "publishedYear": 2006,
    "genre": "Educational",
    "category": "Finance",
    "language": "English",
    "rating": 3.5,
    "description": "Comprehensive guide to how technology reshapes capital markets, financial services, and fintech systems. It covers trading systems, risk management, and electronic markets. Freedman provides both technical background and practical applications. The book bridges finance theory with modern computing. It remains a valuable primer as fintech continues to expand rapidly.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9780123704788-M.jpg"
  },
  {
    "title": "Marketing 5.0: Technology for Humanity",
    "author": "Philip Kotler, Hermawan Kartajaya, Iwan Setiawan",
    "price": 550,
    "publishedYear": 2021,
    "genre": "Educational",
    "category": "Marketing & Advertising",
    "language": "English",
    "rating": 4.5,
    "description": "Explores how marketers can integrate cutting‑edge technology such as AI and automation into marketing strategies. It argues for balancing advanced tools with human understanding. Topics include data-driven insights, predictive analytics, and customer experience. Kotler and coauthors extend his influential marketing principles into the digital age. The book positions technology as a partner to enhance human needs.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL33050405M-M.jpg"
  },
  {
    "title": "Lean Marketing",
    "author": "Jaclyn McDowall",
    "price": 300,
    "publishedYear": 2015,
    "genre": "Educational",
    "category": "Marketing & Advertising",
    "language": "English",
    "rating": 3.0,
    "description": "A practical, lean startup approach to validating marketing campaigns and product innovation. The book reiterates the value of rapid experimentation in business. It aligns marketing with customer feedback and data cycles. The style is concise and pragmatic, with tools for modern teams. Ideal for startups adopting agile principles in marketing strategies.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL25934512M-M.jpg"
  },
  {
    "title": "Architecting the Cloud: Design Decisions for Cloud Computing Service Models",
    "author": "Michael J. Kavis",
    "price": 350,
    "publishedYear": 2014,
    "genre": "Educational",
    "category": "Technology",
    "language": "English",
    "rating": 3.5,
    "description": "Guide to designing enterprise-level cloud architectures across IaaS, PaaS, and SaaS models. It covers scalability, reliability, and cost-effectiveness at scale. The book explains trade-offs between different cloud strategies. Real-world examples support decision-making for architects and engineers. It acts as both a reference book and practical workbook for cloud practitioners.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL25440972M-M.jpg"
  },
  {
    "title": "Big Data: Principles and Best Practices of Scalable Real-Time Data Systems",
    "author": "Nathan Marz, James Warren",
    "price": 450,
    "publishedYear": 2015,
    "genre": "Educational",
    "category": "Technology",
    "language": "English",
    "rating": 3.5,
    "description": "Technical overview of building scalable big data systems with Apache Storm and streaming architecture. It details the Lambda Architecture for real-time data processing. The book focuses on distributed system design and fault tolerance. It is written for engineers managing large-scale data pipelines. A foundational resource for understanding modern big data ecosystems.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL26860715M-M.jpg"
  }
]
