[
  {
    "title": "1984",
    "author": "George Orwell",
    "price": 250,
    "publishedYear": 1949,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.0,
    "description": "Dystopian classic about totalistic surveillance. The story explores a grim future where individuality is crushed by a totalitarian regime. Orwell portrays Big Brother as the ultimate symbol of authoritarian power. Themes of propaganda, psychological control, and loss of freedom dominate the novel. It remains one of the most influential works warning against unchecked political power.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/0451524934-M.jpg"
  },
  {
    "title": "Murder Most Foul",
    "author": "Ray Bradbury, Jack London, Edgar Allan Poe et al.",
    "price": 350,
    "publishedYear": 1984,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 3.5,
    "description": "Anthology of classic mystery stories. This collection brings together several great writers known for suspense and detective fiction. It includes eerie tales, chilling whodunits, and psychological thrillers. Each story offers a glimpse into different writing styles and narrative twists. Ideal for readers who enjoy vintage and timeless mysteries.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL15365739M-M.jpg"
  },
  {
    "title": "The Body in the Library",
    "author": "Agatha Christie",
    "price": 275,
    "publishedYear": 1942,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.0,
    "description": "Miss Marple investigates a body found in a library. Classic Christie charm blends with clever misdirection and small‑village secrets. The novel showcases her keen observation of human nature. Clues are sprinkled in deceptively simple ways. Suspense builds to a satisfying, unexpected reveal in true Christie fashion.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL9241041M-M.jpg"
  },
  {
    "title": "The Mystery of a Hansom Cab",
    "author": "Fergus Hume",
    "price": 350,
    "publishedYear": 1886,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 3.5,
    "description": "Whodunit classic set in Victorian Melbourne. Considered one of the first true detective novels, it captures 19th‑century society vividly. The plot follows a murder investigation beginning in a hansom cab. Class politics and social intrigue play major roles in the mystery. Its runaway success influenced later detective fiction worldwide.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL8476357M-M.jpg"
  },
  {
    "title": "The Red House Mystery",
    "author": "A. A. Milne",
    "price": 250,
    "publishedYear": 1922,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 4.5,
    "description": "A.A. Milne’s only mystery novel. Best known as the creator of Winnie‑the‑Pooh, Milne crafts a clever country‑house murder. Amateur sleuths piece together alibis, motives, and hidden truths. The writing blends humor, charm, and puzzle‑like plotting. A treat for fans of Golden Age detective fiction.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL6032228M-M.jpg"
  },
  {
    "title": "Iron Lake",
    "author": "William Kent Krueger",
    "price": 400,
    "publishedYear": 1998,
    "genre": "Fiction",
    "category": "Mystery & Thriller",
    "language": "English",
    "rating": 3.5,
    "description": "First Cork O’Connor novel set in Minnesota. It introduces readers to the ex‑sheriff navigating crime, politics, and Native American culture. The book blends a murder mystery with emotional family struggles. Small-town atmosphere and wilderness elements create added tension. It laid the foundation for a popular long‑running series.",
    "coverImageUrl": "https://covers.openlibrary.org/b/isbn/9780671036904-M.jpg"
  },
  {
    "title": "The Night Circus",
    "author": "Erin Morgenstern",
    "price": 350,
    "publishedYear": 2011,
    "genre": "Fiction",
    "category": "Fantasy",
    "language": "English",
    "rating": 2.5,
    "description": "Phantasmagorical magical competition. A mysterious traveling circus becomes the arena for two rival illusionists. The setting is steeped in vivid imagery and dreamlike enchantment. Romance slowly develops amid the rivalry, adding emotional suspense. Known for its atmospheric tone and lyrical style, it divides readers with its unconventional pacing.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL24983156M-M.jpg"
  },
  {
    "title": "Stardust",
    "author": "Neil Gaiman",
    "price": 200,
    "publishedYear": 1999,
    "genre": "Fiction",
    "category": "Fantasy",
    "language": "English",
    "rating": 4.0,
    "description": "Magical fantasy quest beyond the wall. The novel mixes fairy‑tale whimsy with darker mythic tones. A young man ventures into a magical land to retrieve a fallen star. Along the way, he faces witches, rival seekers, and enchanted worlds. Gaiman’s storytelling blends folklore with modern sensibilities for timeless appeal.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL7288669M-M.jpg"
  },
  {
    "title": "A Court of Silver Flames",
    "author": "Sarah J. Maas",
    "price": 350,
    "publishedYear": 2021,
    "genre": "Fiction",
    "category": "Fantasy",
    "language": "English",
    "rating": 3.5,
    "description": "High fantasy romance with power struggles. This installment focuses on Nesta Archeron’s personal journey of healing. Themes of trauma, resilience, and female empowerment are central. Relationships deepen in both intimate and political ways. Action, romance, and magic intertwine in Maas’s signature style.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL45302483M-M.jpg"
  },
  {
    "title": "The Price of Salt",
    "author": "Patricia Highsmith",
    "price": 350,
    "publishedYear": 1952,
    "genre": "Fiction",
    "category": "Romance & Comedy",
    "language": "English",
    "rating": 3.5,
    "description": "A lesbian romance classic. It tells the story of Therese and Carol’s unexpected romance in 1950s America. Unlike many works at the time, it offered a hopeful ending. Themes of identity, forbidden love, and self‑discovery dominate. The book influenced LGBTQ+ literature for decades.",
    "coverImageUrl": "https://covers.openlibrary.org/b/olid/OL6111394M-M.jpg"
  }
]
